In [1]:
# 필요 모듈
import pandas as pd
import requests
import json
import config
import pymysql
import sqlalchemy

## Extract

In [2]:
# 550~555번 데이터
response_list = []
API_KEY = config.api_key

for movie_id in range(550,556):
    r = requests.get('https://api.themoviedb.org/3/movie/{}?api_key={}'.format(movie_id, API_KEY))
    response_list.append(r.json())
    
df = pd.DataFrame.from_dict(response_list)

df

,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,/rr7E0NoGKxvbkb89eR1GwfoYjpA.jpg,None,63000000,"[{'id': 18, 'name': 'Drama'}]",http://www.foxmovies.com/movies/fight-club,550,tt0137523,en,Fight Club,...,1999-10-15,100853753,139,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Mischief. Mayhem. Soap.,Fight Club,False,8.400,24765
1,False,/v1QEIuBM1vvpvfqalahhIyXY0Cm.jpg,"{'id': 372257, 'name': 'The Poseidon Adventure...",5000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",,551,tt0069113,en,The Poseidon Adventure,...,1972-12-13,84563118,117,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"Hell, upside down.",The Poseidon Adventure,False,7.136,674
2,False,/k4JIHyAXaGHwAwT7y5Skd17f0Wl.jpg,None,0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",,552,tt0237539,it,Pane e tulipani,...,2000-03-03,8478434,114,"[{'english_name': 'Italian', 'iso_639_1': 'it'...",Released,Imagine your life. Now go live it.,Bread and Tulips,False,7.292,214
3,False,/r3xsFBD1VTUusk393bBc7SsDUJe.jpg,"{'id': 1952, 'name': 'USA: Land of Opportuniti...",10000000,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",,553,tt0276919,en,Dogville,...,2003-05-19,16680836,178,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,A quiet little town not far from here.,Dogville,False,7.791,1986
4,False,/1qwXItFKqvKYyW1CwbYhxyUC8Pj.jpg,None,0,"[{'id': 18, 'name': 'Drama'}, {'id': 36, 'name...",,554,tt0308476,ru,Кукушка,...,2002-01-01,0,100,"[{'english_name': 'German', 'iso_639_1': 'de',...",Released,She's Making Peace One Man at a Time.,The Cuckoo,False,7.045,66
5,False,None,None,0,"[{'id': 53, 'name': 'Thriller'}]",http://www.luecke-im-system.de/,555,tt0442896,en,Absolut,...,2005-04-20,0,94,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,,Absolut,False,7.900,20

In [3]:
df.columns

Index(['adult', 'backdrop_path', 'belongs_to_collection', 'budget', 'genres',
       'homepage', 'id', 'imdb_id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count'],
      dtype='object')

## Transform

In [4]:
# 장르
genres_list = df['genres'].tolist()
flat_list = [item for sublist in genres_list for item in sublist]

result = []
for l in genres_list:
    r = []
    for d in l:
        r.append(d['name'])
    result.append(r)
df = df.assign(genres_all=result)

df_genres = pd.DataFrame.from_records(flat_list).drop_duplicates()

df_genres

       id       name
0      18      Drama
1      28     Action
2      12  Adventure
3      53   Thriller
4      35     Comedy
5   10749    Romance
6      80      Crime
10     36    History

In [5]:
# 범주
df_columns = ['budget', 'id', 'imdb_id', 'original_title', 'release_date', 'revenue', 'runtime']
df_genre_columns = df_genres['name'].to_list()
df_columns.extend(df_genre_columns)
s = df['genres_all'].explode()
df = df.join(pd.crosstab(s.index, s))

df[df_columns]

,budget,id,imdb_id,original_title,release_date,revenue,runtime,Drama,Action,Adventure,Thriller,Comedy,Romance,Crime,History
0,63000000,550,tt0137523,Fight Club,1999-10-15,100853753,139,1,0,0,0,0,0,0,0
1,5000000,551,tt0069113,The Poseidon Adventure,1972-12-13,84563118,117,0,1,1,1,0,0,0,0
2,0,552,tt0237539,Pane e tulipani,2000-03-03,8478434,114,0,0,0,0,1,1,0,0
3,10000000,553,tt0276919,Dogville,2003-05-19,16680836,178,1,0,0,1,0,0,1,0
4,0,554,tt0308476,Кукушка,2002-01-01,0,100,1,0,0,0,1,1,0,1
5,0,555,tt0442896,Absolut,2005-04-20,0,94,0,0,0,1,0,0,0,0

In [6]:
# 날짜
df['release_date'] = pd.to_datetime(df['release_date'])
df['day'] = df['release_date'].dt.day
df['month'] = df['release_date'].dt.month
df['year'] = df['release_date'].dt.year
df['day_of_week'] = df['release_date'].dt.day_name()
df_time_columns = ['id', 'release_date', 'day', 'month', 'year', 'day_of_week']

df[df_time_columns]

    id release_date  day  month  year day_of_week
0  550   1999-10-15   15     10  1999      Friday
1  551   1972-12-13   13     12  1972   Wednesday
2  552   2000-03-03    3      3  2000      Friday
3  553   2003-05-19   19      5  2003      Monday
4  554   2002-01-01    1      1  2002     Tuesday
5  555   2005-04-20   20      4  2005   Wednesday

In [7]:
df_practice = ['id', 'title', 'release_date', 'runtime']

df[df_practice]

    id                   title release_date  runtime
0  550              Fight Club   1999-10-15      139
1  551  The Poseidon Adventure   1972-12-13      117
2  552        Bread and Tulips   2000-03-03      114
3  553                Dogville   2003-05-19      178
4  554              The Cuckoo   2002-01-01      100
5  555                 Absolut   2005-04-20       94

## Load (DBMS 적용)

In [9]:
# DB 연결
db_connection_str = 'mysql+pymysql://bigdata:bigdata@localhost/playdata'
db_connection = sqlalchemy.create_engine(db_connection_str)
conn = db_connection.connect()

# 타입 설정
dtypesql = {'id':sqlalchemy.Integer(), 
          'title':sqlalchemy.types.VARCHAR(250), 
          'release_date':sqlalchemy.types.VARCHAR(20),
          'runtime':sqlalchemy.Integer(), 
}

# dtypesql = {'id':sqlalchemy.Integer(), 
#           'title':sqlalchemy.types.VARCHAR(250), 
#           'release_date':sqlalchemy.Date(),
#           'runtime':sqlalchemy.Integer(), 
# }

df[df_practice].to_sql(name='etl', con=db_connection, if_exists='replace', index=False, dtype=dtypesql)

6

In [10]:
# primary key 지정
with db_connection.connect() as con:
    con.execute('ALTER TABLE `etl` ADD PRIMARY KEY (`id`);')